/// @file 
/// @brief Файл содержит реализацию классов для хранения свойств ошибок используемые при генерации исключений
#include <rpc/include/precompiled.h>

namespace rpc
{
namespace value
{
//=====================================================================================================================
rpc::enums::ErrorCode Exception::GetCode( void ) const throw()
{
	return code_;
}
//=====================================================================================================================
const std::wstring& Exception::GetMessage( void ) const throw()
{
	return message_;
}
//=====================================================================================================================
Exception::Exception( const rpc::enums::ErrorCode code ) 
	: message_( rpc::GetErrorMessage( code_) ), code_( code )
{
}
//=====================================================================================================================
Exception::Exception( const rpc::enums::ErrorCode code, const std::wstring& message ) 
	: message_( message ), code_( code )
{
}
//=====================================================================================================================  
Exception::~Exception()
{
}
//=====================================================================================================================  
} 
}
